slide/tutorial-scheme/tutorial-scheme.org
#+TITLE: Tutorial -- Scheme
#+SETUPFILE: ../slide-setup.org
#+LATEX_HEADER: \AtBeginSection[]{\begin{frame}<beamer>\frametitle{Content}\tableofcontents[currentsection]\end{frame}}

* Get Started

** Hello World!

   Enter the following code with your favorite editor (Emacs for me)
   and save to a file called ~hello.scm~.

   #+BEGIN_SRC scheme :tangle src/hello.scm
;; Hello World!
(begin
  (display "Hello World!")
  (newline))
   #+END_SRC

   1. The first line is a comment.  Scheme ignores everything
      following a semicolon.
   2. =begin= /form/ is =Scheme='s way of introducing sequential
      /subforms/, i.e., sequential statements.
   3. =display= procedure outputs its argument ("Hello World!") to the
      standard output, i.e., the console.
   4. =newline= procedure outputs a carriage return.

** Environment

   There are lots of =Scheme= implementations, GNU guile, mit-scheme,
   CHICKEN scheme, Racket and etc.  I'm using GNU guile.

   To run the above program

   #+BEGIN_EXAMPLE
   $ guile
   $ scheme@(guile-user)> (load "hello.scm")
   #+END_EXAMPLE

   - The first line invokes the GNU guile interpreter.
   - Entering into the guile environment, you will see prompt
     =scheme@(guile-user)>=.  Just type in any =Scheme= forms.
   - =(load "hello.scm")= loads and runs the file ~hello.scm~.

** Setup =Scheme=

   Various options to setup =Scheme= environment.

   - Linux machines in Computer Lab and Davis Hall 123 have mit-scheme
     installed.
   - You may install guile yourself.
     - Compile and install /locally/ on Computer Lab or Davis Hall
       123, which requires some knowledge of Linux, or
     - Install with package manager if you have Linux installed on
       your laptop.


   Most of the code snippets adheres to R^{6}RS and should be working
   with all compatible =Scheme= implementations, except those
   commented with "guile".

   #+BEGIN_SRC scheme
(inf? 3)                                ; => #f, guile
   #+END_SRC

** Hello World! Cont'd

   Entering into the guile interactive environment, you may type in
   your programs directly

   - Type in the form at =Scheme= prompt, you will see =Hello World!=.

     #+BEGIN_SRC scheme
(begin (display "Hello World!")
       (newline))
     #+END_SRC

   - Or you could directly type in the form.

     #+BEGIN_SRC scheme
"Hello World!"
     #+END_SRC

     which gives you back the string =​"Hello World"​=.

** Hello World! Cont'd

   Difference between the previous two approaches

   - Trivial difference: the first gives you =Hello World!= without
     double quote.
   - Important difference: the first form /evaluates/ to /nothing/,
     =Hello World!= is only a *side effect* of =display=.  ~=>~
     is "/evaluates to/".

     #+BEGIN_SRC scheme
(begin (display "Hello World!")
       (newline))
=>
     #+END_SRC

     The second evaluates to =​"Hello World!"​=.

     #+BEGIN_SRC scheme
"Hello World!"
=> "Hello World"
     #+END_SRC

* Overview

** Overview

   =Scheme= features are summarized as follows.

   - Statically scoped PL with lexical binding.
   - /Latent/ as opposed to /manifest/ type.
   - Type associated with objects rather than variables.
   - One of the first PL to support procedures as objects.
   - /Continuations/ is "first-class".
   - Arguments are evaluated /before/ procedure call.
   - Distinguishes /exact/ and /inexact/ number objects.

** Expression

   Expressions can be evaluated, producing a value.

   - Literal expressions.

     #+BEGIN_SRC scheme
#t                                      ; => #t
23                                      ; => 23
     #+END_SRC

   - Compound expression.  Enclosing subexpressions with parenthesis,
     where The first subexpression is an operation and the remainings
     are operands to the operation

     #+BEGIN_SRC scheme
(+ 1 1)                                 ; => 2
(+ 1 (* 1 1))                           ; => 2
     #+END_SRC


   Whitespace (including line endings) is not significant when it
   separates subexpressions of an expression.

** Form

   - Form :: The general name for a syntactic part of a =Scheme=
        program.


   #+BEGIN_SRC scheme
(define x 3)                            ; definition
(+ 3 4)                                 ; expression
   #+END_SRC

   - Both are forms, their distinction depends on the bindings for
     =define= and =+=.
   - In particular, 23 is a /subform/ of the form =(define x 23)=.

* Data Types

** Boolean

   =Scheme= uses =#t= for true and =#f= for false.  The =boolean?=
   predicate procedure (usually ends with a =?=) checks whether its
   argument is Boolean.

   #+BEGIN_SRC scheme
(boolean? #t)                           ; => #t
(boolean? #f)                           ; => #t
(boolean? "Hello World!")               ; => #f
   #+END_SRC

** Numeric

   =Scheme= numeric data types include integer (32, 10), rational
   (22/7, /no space/ around the slash), real (3.1416) and complex
   (2+3i, /no space/ in between).

   #+BEGIN_SRC scheme
(integer? 32)                           ; => #t
(rational? 32)                          ; => #t
(real? 32)                              ; => #t
(complex? 32)                           ; => #t
(number? 32)                            ; => #t
(number? #t)                            ; => #f
(complex? 3+2i)                         ; => #t
(rational? 22/7)                        ; => #t
   #+END_SRC

** Real and Rational in Guile

   Mathematically, we have

   \[\text{Integer }\in\text{ Rational }\in\text{ Real }\in\text{
   Complex}
   \]

   - Guile can represent both /exact/ and /inexact/ rational numbers.
     - Exact rational is represented by storing the numerator and
       denominator as two exact integers.
     - Inexact rational is represented as foaling numbers.
   - It /cannot/ represent precise finite irrational numbers.
   - =rational?= and =real?= predicates are /equivalent/.

** Non-Numbers in Guile

   - Dividing by /exact/ zero leads to an error message.
   - Dividing by /inexact/ zero produces positive or negative
     infinite.
   - Dividing /inexact/ zeros produces NaN.

   #+BEGIN_SRC scheme
(/ 1 0)                                 ; ERROR
(/ 1 0.0)                               ; => +inf.0
(/ 1 -0.)                               ; => -inf.0
(/ 0. 0.)                               ; => +nan.0
(nan? (/ 0. 0.))                        ; => #t, guile
(inf? (/ 1 -0.))                        ; => #t, guile
   #+END_SRC

