slide/tutorial-scheme/tutorial-scheme.tex
% Created 2016-01-04 Mon 16:04
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[activate={true,nocompatibility},final,tracking=true,kerning=true,spacing=true,factor=1100,stretch=10,shrink=10]{microtype}
\usepackage{minted}
\usepackage{svg}
\usepackage[backend=biber,style=alphabetic]{biblatex}
\fvset{fontsize=\footnotesize}
\fvset{frame=lines}
\fvset{framesep=5pt}
\DeclareUnicodeCharacter{200B}{}
\addbibresource{~/Documents/comp3220/master/comp3220.bib}
\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Content}\tableofcontents[currentsection]\end{frame}}
\usetheme{default}
\author{Zhitao Gong}
\date{2016 Spring}
\title{Tutorial -- Scheme}
\subtitle{COMP3220 -- Principle of Programming Languages}
\hypersetup{
      pdfauthor={Zhitao Gong},
      pdftitle={Tutorial -- Scheme},
      pdfkeywords={},
      pdfsubject={},
      pdfcreator={Emacs 24.5.1 (Org mode 8.3.2)},
      pdflang={English},
      bookmarks=true,
      unicode=true,
      pdftoolbar=true,
      pdfmenubar=true,
      pdffitwindow=false,
      pdfstartview={FitW},
      pdfnewwindow=true,
      colorlinks=true,
      linkcolor=red,
      citecolor=green,
      filecolor=magenta,
      urlcolor=cyan}
\begin{document}

\maketitle
\begin{frame}{Outline}
\setcounter{tocdepth}{2}
\tableofcontents
\end{frame}


\section{Get Started}
\label{sec:orgheadline6}

\begin{frame}[fragile,label={sec:orgheadline1}]{Hello World!}
 Enter the following code with your favorite editor (Emacs for me)
and save to a file called \texttt{hello.scm}.

\begin{minted}[]{scheme}
;; Hello World!
(begin
  (display "Hello World!")
  (newline))
\end{minted}

\begin{enumerate}
\item The first line is a comment.  Scheme ignores everything
following a semicolon.
\item \texttt{begin} \emph{form} is \texttt{Scheme}'s way of introducing sequential
\emph{subforms}, i.e., sequential statements.
\item \texttt{display} procedure outputs its argument ("Hello World!") to the
standard output, i.e., the console.
\item \texttt{newline} procedure outputs a carriage return.
\end{enumerate}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline2}]{Environment}
 There are lots of \texttt{Scheme} implementations, GNU guile, mit-scheme,
CHICKEN scheme, Racket and etc.  I'm using GNU guile.

To run the above program

\begin{verbatim}
$ guile
$ scheme@(guile-user)> (load "hello.scm")
\end{verbatim}

\begin{itemize}
\item The first line invokes the GNU guile interpreter.
\item Entering into the guile environment, you will see prompt
\texttt{scheme@(guile-user)>}.  Just type in any \texttt{Scheme} forms.
\item \texttt{(load "hello.scm")} loads and runs the file \texttt{hello.scm}.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline3}]{Setup \texttt{Scheme}}
 Various options to setup \texttt{Scheme} environment.

\begin{itemize}
\item Linux machines in Computer Lab and Davis Hall 123 have mit-scheme
installed.
\item You may install guile yourself.
\begin{itemize}
\item Compile and install \emph{locally} on Computer Lab or Davis Hall
123, which requires some knowledge of Linux, or
\item Install with package manager if you have Linux installed on
your laptop.
\end{itemize}
\end{itemize}


Most of the code snippets adheres to R\(^{\text{6}}\)RS and should be working
with all compatible \texttt{Scheme} implementations, except those
commented with "guile".

\begin{minted}[]{scheme}
(inf? 3)                                ; => #f, guile
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline4}]{Hello World! Cont'd}
 Entering into the guile interactive environment, you may type in
your programs directly

\begin{itemize}
\item Type in the form at \texttt{Scheme} prompt, you will see \texttt{Hello World!}.

\begin{minted}[]{scheme}
(begin (display "Hello World!")
       (newline))
\end{minted}

\item Or you could directly type in the form.

\begin{minted}[]{scheme}
"Hello World!"
\end{minted}

which gives you back the string \texttt{​"Hello World"​}.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline5}]{Hello World! Cont'd}
 Difference between the previous two approaches

\begin{itemize}
\item Trivial difference: the first gives you \texttt{Hello World!} without
double quote.
\item Important difference: the first form \emph{evaluates} to \emph{nothing},
\texttt{Hello World!} is only a \alert{side effect} of \texttt{display}.  \texttt{=>}
is "\emph{evaluates to}".

\begin{minted}[]{scheme}
(begin (display "Hello World!")
       (newline))
=>
\end{minted}

The second evaluates to \texttt{​"Hello World!"​}.

\begin{minted}[]{scheme}
"Hello World!"
=> "Hello World"
\end{minted}
\end{itemize}
\end{frame}

\section{Overview}
\label{sec:orgheadline10}

\begin{frame}[fragile,label={sec:orgheadline7}]{Overview}
 \texttt{Scheme} features are summarized as follows.

\begin{itemize}
\item Statically scoped PL with lexical binding.
\item \emph{Latent} as opposed to \emph{manifest} type.
\item Type associated with objects rather than variables.
\item One of the first PL to support procedures as objects.
\item \emph{Continuations} is "first-class".
\item Arguments are evaluated \emph{before} procedure call.
\item Distinguishes \emph{exact} and \emph{inexact} number objects.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline8}]{Expression}
 Expressions can be evaluated, producing a value.

\begin{itemize}
\item Literal expressions.

\begin{minted}[]{scheme}
#t                                      ; => #t
23                                      ; => 23
\end{minted}

\item Compound expression.  Enclosing subexpressions with parenthesis,
where The first subexpression is an operation and the remainings
are operands to the operation

\begin{minted}[]{scheme}
(+ 1 1)                                 ; => 2
(+ 1 (* 1 1))                           ; => 2
\end{minted}
\end{itemize}


Whitespace (including line endings) is not significant when it
separates subexpressions of an expression.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline9}]{Form}
 \begin{description}
\item[{Form}] The general name for a syntactic part of a \texttt{Scheme}
        program.
\end{description}


\begin{minted}[]{scheme}
(define x 3)                            ; definition
(+ 3 4)                                 ; expression
\end{minted}

\begin{itemize}
\item Both are forms, their distinction depends on the bindings for
\texttt{define} and \texttt{+}.
\item In particular, 23 is a \emph{subform} of the form \texttt{(define x 23)}.
\end{itemize}
\end{frame}

\section{Data Types}
\label{sec:orgheadline27}

\begin{frame}[fragile,label={sec:orgheadline11}]{Boolean}
 \texttt{Scheme} uses \texttt{\#t} for true and \texttt{\#f} for false.  The \texttt{boolean?}
predicate procedure (usually ends with a \texttt{?}) checks whether its
argument is Boolean.

\begin{minted}[]{scheme}
(boolean? #t)                           ; => #t
(boolean? #f)                           ; => #t
(boolean? "Hello World!")               ; => #f
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline12}]{Numeric}
 \texttt{Scheme} numeric data types include integer (32, 10), rational
(22/7, \emph{no space} around the slash), real (3.1416) and complex
(2+3i, \emph{no space} in between).

\begin{minted}[]{scheme}
(integer? 32)                           ; => #t
(rational? 32)                          ; => #t
(real? 32)                              ; => #t
(complex? 32)                           ; => #t
(number? 32)                            ; => #t
(number? #t)                            ; => #f
(complex? 3+2i)                         ; => #t
(rational? 22/7)                        ; => #t
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline13}]{Real and Rational in Guile}
 Mathematically, we have

\[\text{Integer }\in\text{ Rational }\in\text{ Real }\in\text{
   Complex}
   \]

\begin{itemize}
\item Guile can represent both \emph{exact} and \emph{inexact} rational numbers.
\begin{itemize}
\item Exact rational is represented by storing the numerator and
denominator as two exact integers.
\item Inexact rational is represented as foaling numbers.
\end{itemize}
\item It \emph{cannot} represent precise finite irrational numbers.
\item \texttt{rational?} and \texttt{real?} predicates are \emph{equivalent}.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline14}]{Non-Numbers in Guile}
 \begin{itemize}
\item Dividing by \emph{exact} zero leads to an error message.
\item Dividing by \emph{inexact} zero produces positive or negative
infinite.
\item Dividing \emph{inexact} zeros produces NaN.
\end{itemize}

\begin{minted}[]{scheme}
(/ 1 0)                                 ; ERROR
(/ 1 0.0)                               ; => +inf.0
(/ 1 -0.)                               ; => -inf.0
(/ 0. 0.)                               ; => +nan.0
(nan? (/ 0. 0.))                        ; => #t, guile
(inf? (/ 1 -0.))                        ; => #t, guile
\end{minted}
\end{frame}
