slide/tutorial-scheme/tutorial-scheme.org
** Integer in =Scheme=

   =Scheme= natively supports binary, hex and octal integer format.

   - =#b= prefix for binary format
   - =#o= prefix for octal format
   - =#d= /optional/ prefix for decimal format
   - =#x= prefix for hex format

   #+BEGIN_SRC scheme
(= #b11 3)                              ; => #t
(= #o3 3)                               ; => #t
(= #x3 3)                               ; => #t
(= #d3 3)                               ; => #t
   #+END_SRC

** Number Comparison

   /Number comparison/ includes ~=~, ~<~, ~<=~, ~>~ and ~>=~.

   #+BEGIN_SRC scheme
(= 42 42)                               ; => #t
(= 42 42.0)                             ; => #t
(= 42.2 #f)                             ; ERROR
(< 3 3.5)                               ; => #t
(>= 3 3.5)                              ; => #f
   #+END_SRC

** Arithmetic Procedures

   Common arithmetic procedures include =+=, =-=, =*=, =/=.

   - =+=, =-= and =*= may take more than two arguments.
   - For single argument, =-= serves as negation and =/= reciprocal.


   #+BEGIN_SRC scheme
(+ 1 2 3)                               ; =>  6
(- 5.3 2)                               ; =>  3.3
(- 5 2 1)                               ; =>  2
(* 1 2 3)                               ; =>  6
(/ 6 3)                                 ; =>  2
(/ 22 7)                                ; =>  22/7
(- 4)                                   ; =>  -4
(/ 4)                                   ; =>  1/4
   #+END_SRC


** Equality Predicate

   - ~=~ :: Whether two /numbers/ are equal.
   - =eq?= :: Whether two parameters represent the /same object/ in
        memory.
   - =eqv?= :: Same as the =eq?= predicate, except that it will always
        return =#t= for same primitive values.
   - =equal?= :: Element-wise version for =eqv?=.

** Predicate ~=~

   Use the ~=~ predicate when you want to compare two numbers.

   #+BEGIN_SRC scheme
(= 2 3)                                 ; => #f
(= 2.5 2.5)                             ; => #t
(= '() '())                             ; ERROR!
   #+END_SRC

** Predicate =eq?=

   Do not use the =eq?= predicate unless you know what you're doing.

   #+BEGIN_SRC scheme
(define x '(2 3))
(define y '(2 3))
(eq? x y)                               ; => #f
(define y x)
(eq? x y)                               ; => #t
   #+END_SRC

   Note however that there's only one empty list =​'()= in memory.

   #+BEGIN_SRC scheme
(define x '())
(define y '())
(eq? x y)                               ; => #t
   #+END_SRC

** Predicate =eqv?=

   The effect of =eq?= on primitive types are undefined and
   implementation dependent.  That what =eqv?= is for.

   #+BEGIN_SRC scheme
(eq? 2 2)                               ; implementation dependent
(eq? "a" "a")                           ; implementation dependent
(eqv? 2 2)                              ; => #t
(eqv? "a" "a")                          ; => #t
   #+END_SRC

   So generally, \(\text{\texttt{eq?} }\in\text{\texttt{eqv?}}\),
   i.e., =eqv?= is a superset of =eq?=.

** Predicate =equal?=

   Use the =equal?= predicate when you wish to test whether two lists,
   vectors, etc. are /element-wise/ equivalent.

   #+BEGIN_SRC scheme
(define x '(2 3))
(define y '(2 3))
(equal? x y)                            ; => #t
(eqv? x y)                              ; => #f
   #+END_SRC

** Character

   =Scheme= character data are represented by prefixing the character
   with =#\=.

   - The predicate =char?= checks whether it is a character.
   - Some non-graphic characters have more descriptive names.

   #+BEGIN_SRC scheme
(char? #\c)                             ; => #t
(char? 1)                               ; => #f
(char? #\;)                             ; => #t
(char? #\newline)                       ; => #t
(char? #\tab)                           ; => #t
(eqv? #\  #\space)                      ; => #t, TWO SPACES!!
   #+END_SRC

** Character Operations

   The character has a set of comparison predicates: ~char=?~,
   ~char<?~, ~char<=?~, ~char>?~, ~char>=?~.

   #+BEGIN_SRC scheme
(char=? #\a #\a)                        ; => #t
(char>=? #\a #\B)                       ; => #f
   #+END_SRC

   Use =char-ci= to make the comparison /case-sensitive/.

   #+BEGIN_SRC scheme
(char-ci=? #\a #\A)                     ; => #t
(char-ci<? #\a #\B)                     ; => #t
   #+END_SRC

   Case conversion procedures are =char-downcase= and =char-upcase=.

   #+BEGIN_SRC scheme
(char-downcase #\A)                     ; => #\a
(char-upcase #\a)                       ; => #\A
   #+END_SRC

** Symbol

   The above primitives are /self-evaluating/.

   #+BEGIN_SRC scheme
#t                                      ; => #t
32                                      ; => 32
#\c                                     ; => #\c
   #+END_SRC

   Symbols are not.  They are treated as /identifiers/, thus evaluated
   to the value they hold. To specify a symbol, =quote= it.  Predicate
   =symbol?= checks for symbol type.

   #+BEGIN_SRC scheme
(quote var)                             ; => var
'var                                    ; => var
(symbol? 'var)                          ; => #t
(symbol? '<=>)                          ; => #t
(symbol? '$!#*)                         ; => #t
(symbol? '#t)                           ; => #f
   #+END_SRC

** Symbol Cont'd

   Symbols are /case-insensitive/.  In Guile symbols are case
   sensitive.

   #+BEGIN_SRC scheme
(eqv? 'Calorie 'calorie)                ; => #t, (#f in guile)
   #+END_SRC

   Use =define= To define a symbol with value and =set!= to change the
   value of a symbol.

   #+BEGIN_SRC scheme
(define var 9)
var                                     ; => 9
(set! var #\c)
var                                     ; #\c
   #+END_SRC

* Compound Data Types

** String

   - Double-quoted character produces string.

     #+BEGIN_SRC scheme
"Hello World!"                          ; => "Hello World!"
     #+END_SRC

   - Procedure =string= constructs string from /characters/.

     #+BEGIN_SRC scheme
(string #\h #\e #\l #\l #\o)            ; => "hello"
     #+END_SRC

   - Procedure =make-string= constructs an empty string (string with
     null character '\0x00') with given length.

     #+BEGIN_SRC scheme
(make-string 3)                         ; => "\x00\x00\x00"
     #+END_SRC

   String type are checked with =string?= predicate.

** String Operations

   The characters in a string could be individually accessed with
   procedure =string-ref=.  Characters are 0-base indexed.

   #+BEGIN_SRC scheme
(define greeting "Hello World")
(string-ref greeting 0)                 ; => #\H
   #+END_SRC

   Strings may be appended together.

   #+BEGIN_SRC scheme
(string-append "Hello " "World" "!")    ; => "Hello World!"
   #+END_SRC

   Strings are mutable.  The procedure =string-set!= replaces the
   character at a given index.

   #+BEGIN_SRC scheme
(define hello "hello")
(string-set! hello 0 #\H)
hello                                   ; => "Hello"
   #+END_SRC

