slide/tutorial-scheme/tutorial-scheme.tex

\begin{frame}[fragile,label={sec:orgheadline15}]{Integer in \texttt{Scheme}}
 \texttt{Scheme} natively supports binary, hex and octal integer format.

\begin{itemize}
\item \texttt{\#b} prefix for binary format
\item \texttt{\#o} prefix for octal format
\item \texttt{\#d} \emph{optional} prefix for decimal format
\item \texttt{\#x} prefix for hex format
\end{itemize}

\begin{minted}[]{scheme}
(= #b11 3)                              ; => #t
(= #o3 3)                               ; => #t
(= #x3 3)                               ; => #t
(= #d3 3)                               ; => #t
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline16}]{Number Comparison}
 \emph{Number comparison} includes \texttt{=}, \texttt{<}, \texttt{<=}, \texttt{>} and \texttt{>=}.

\begin{minted}[]{scheme}
(= 42 42)                               ; => #t
(= 42 42.0)                             ; => #t
(= 42.2 #f)                             ; ERROR
(< 3 3.5)                               ; => #t
(>= 3 3.5)                              ; => #f
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline17}]{Arithmetic Procedures}
 Common arithmetic procedures include \texttt{+}, \texttt{-}, \texttt{*}, \texttt{/}.

\begin{itemize}
\item \texttt{+}, \texttt{-} and \texttt{*} may take more than two arguments.
\item For single argument, \texttt{-} serves as negation and \texttt{/} reciprocal.
\end{itemize}


\begin{minted}[]{scheme}
(+ 1 2 3)                               ; =>  6
(- 5.3 2)                               ; =>  3.3
(- 5 2 1)                               ; =>  2
(* 1 2 3)                               ; =>  6
(/ 6 3)                                 ; =>  2
(/ 22 7)                                ; =>  22/7
(- 4)                                   ; =>  -4
(/ 4)                                   ; =>  1/4
\end{minted}
\end{frame}


\begin{frame}[fragile,label={sec:orgheadline18}]{Equality Predicate}
 \begin{description}
\item[{\texttt{=}}] Whether two \emph{numbers} are equal.
\item[{\texttt{eq?}}] Whether two parameters represent the \emph{same object} in
memory.
\item[{\texttt{eqv?}}] Same as the \texttt{eq?} predicate, except that it will always
return \texttt{\#t} for same primitive values.
\item[{\texttt{equal?}}] Element-wise version for \texttt{eqv?}.
\end{description}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline19}]{Predicate \texttt{=}}
 Use the \texttt{=} predicate when you want to compare two numbers.

\begin{minted}[]{scheme}
(= 2 3)                                 ; => #f
(= 2.5 2.5)                             ; => #t
(= '() '())                             ; ERROR!
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline20}]{Predicate \texttt{eq?}}
 Do not use the \texttt{eq?} predicate unless you know what you're doing.

\begin{minted}[]{scheme}
(define x '(2 3))
(define y '(2 3))
(eq? x y)                               ; => #f
(define y x)
(eq? x y)                               ; => #t
\end{minted}

Note however that there's only one empty list \texttt{​'()} in memory.

\begin{minted}[]{scheme}
(define x '())
(define y '())
(eq? x y)                               ; => #t
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline21}]{Predicate \texttt{eqv?}}
 The effect of \texttt{eq?} on primitive types are undefined and
implementation dependent.  That what \texttt{eqv?} is for.

\begin{minted}[]{scheme}
(eq? 2 2)                               ; implementation dependent
(eq? "a" "a")                           ; implementation dependent
(eqv? 2 2)                              ; => #t
(eqv? "a" "a")                          ; => #t
\end{minted}

So generally, \(\text{\texttt{eq?} }\in\text{\texttt{eqv?}}\),
i.e., \texttt{eqv?} is a superset of \texttt{eq?}.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline22}]{Predicate \texttt{equal?}}
 Use the \texttt{equal?} predicate when you wish to test whether two lists,
vectors, etc. are \emph{element-wise} equivalent.

\begin{minted}[]{scheme}
(define x '(2 3))
(define y '(2 3))
(equal? x y)                            ; => #t
(eqv? x y)                              ; => #f
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline23}]{Character}
 \texttt{Scheme} character data are represented by prefixing the character
with \texttt{\#\textbackslash{}}.

\begin{itemize}
\item The predicate \texttt{char?} checks whether it is a character.
\item Some non-graphic characters have more descriptive names.
\end{itemize}

\begin{minted}[]{scheme}
(char? #\c)                             ; => #t
(char? 1)                               ; => #f
(char? #\;)                             ; => #t
(char? #\newline)                       ; => #t
(char? #\tab)                           ; => #t
(eqv? #\  #\space)                      ; => #t, TWO SPACES!!
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline24}]{Character Operations}
 The character has a set of comparison predicates: \texttt{char=?},
\texttt{char<?}, \texttt{char<=?}, \texttt{char>?}, \texttt{char>=?}.

\begin{minted}[]{scheme}
(char=? #\a #\a)                        ; => #t
(char>=? #\a #\B)                       ; => #f
\end{minted}

Use \texttt{char-ci} to make the comparison \emph{case-sensitive}.

\begin{minted}[]{scheme}
(char-ci=? #\a #\A)                     ; => #t
(char-ci<? #\a #\B)                     ; => #t
\end{minted}

Case conversion procedures are \texttt{char-downcase} and \texttt{char-upcase}.

\begin{minted}[]{scheme}
(char-downcase #\A)                     ; => #\a
(char-upcase #\a)                       ; => #\A
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline25}]{Symbol}
 The above primitives are \emph{self-evaluating}.

\begin{minted}[]{scheme}
#t                                      ; => #t
32                                      ; => 32
#\c                                     ; => #\c
\end{minted}

Symbols are not.  They are treated as \emph{identifiers}, thus evaluated
to the value they hold. To specify a symbol, \texttt{quote} it.  Predicate
\texttt{symbol?} checks for symbol type.

\begin{minted}[]{scheme}
(quote var)                             ; => var
'var                                    ; => var
(symbol? 'var)                          ; => #t
(symbol? '<=>)                          ; => #t
(symbol? '$!#*)                         ; => #t
(symbol? '#t)                           ; => #f
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline26}]{Symbol Cont'd}
 Symbols are \emph{case-insensitive}.  In Guile symbols are case
sensitive.

\begin{minted}[]{scheme}
(eqv? 'Calorie 'calorie)                ; => #t, (#f in guile)
\end{minted}

Use \texttt{define} To define a symbol with value and \texttt{set!} to change the
value of a symbol.

\begin{minted}[]{scheme}
(define var 9)
var                                     ; => 9
(set! var #\c)
var                                     ; #\c
\end{minted}
\end{frame}

\section{Compound Data Types}
\label{sec:orgheadline41}

\begin{frame}[fragile,label={sec:orgheadline28}]{String}
 \begin{itemize}
\item Double-quoted character produces string.

\begin{minted}[]{scheme}
"Hello World!"                          ; => "Hello World!"
\end{minted}

\item Procedure \texttt{string} constructs string from \emph{characters}.

\begin{minted}[]{scheme}
(string #\h #\e #\l #\l #\o)            ; => "hello"
\end{minted}

\item Procedure \texttt{make-string} constructs an empty string (string with
null character '$\backslash$0x00') with given length.

\begin{minted}[]{scheme}
(make-string 3)                         ; => "\x00\x00\x00"
\end{minted}
\end{itemize}

String type are checked with \texttt{string?} predicate.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline29}]{String Operations}
 The characters in a string could be individually accessed with
procedure \texttt{string-ref}.  Characters are 0-base indexed.

\begin{minted}[]{scheme}
(define greeting "Hello World")
(string-ref greeting 0)                 ; => #\H
\end{minted}

Strings may be appended together.

\begin{minted}[]{scheme}
(string-append "Hello " "World" "!")    ; => "Hello World!"
\end{minted}

Strings are mutable.  The procedure \texttt{string-set!} replaces the
character at a given index.

\begin{minted}[]{scheme}
(define hello "hello")
(string-set! hello 0 #\H)
hello                                   ; => "Hello"
\end{minted}
\end{frame}
