slide/tutorial-scheme/tutorial-scheme.org
** Vector

   Vectors are sequences with their elements being /anything/.

   #+BEGIN_SRC scheme
(vector 1 2 3 4)                        ; => #(1 2 3 4)
(vector #\a #\b)                        ; => #(#\a #\b)
(vector 1 "e" 'var)                     ; => #(1 "e" var)
   #+END_SRC

   Similar to string type, vector also has =make-vector=, =vector-ref=
   and =vector-set!= procedures.  And as expected, vector is checked
   by predicate =vector?=.

** Pair

   - Pair :: An /ordered/ pair of arbitrary data, with the first
        element and second element referred to as /car/ and /cdr/
        respectively.


   It is constructed by =cons= procedure or =quote= (note the dot in
   between), tested with predicate =pair?=

   #+BEGIN_SRC scheme
(cons 1 #t)                             ; => (1 . #t)
'(#\h . 3.14)                           ; => (#\h . 3.14)
(pair? (cons 1 #t))                     ; => #t
   #+END_SRC

   Dotted pair must be quoted when used as data value since it is not
   self-evaluating.

** Pair Operation

   Pair supports =car=, =cdr= access operation

   #+BEGIN_SRC scheme
(define x (cons 1 #\c))
x                                       ; => (1 . #\c)
(car x)                                 ; => 1
(cdr x)                                 ; => #\c
(define x (1 #\c))                      ; ERROR
   #+END_SRC

   Mutator procedures include =set-car!= and =set-cdr!=.

   #+BEGIN_SRC scheme
(define x (cons 1 2))
x                                       ; => (1 . 2)
(set-car! x #\h)
x                                       ; => (#\h . 2)
(set-cdr! x 3.2)
x                                       ; => (#\h . 3.2)
   #+END_SRC

** Nested Pair

   Pair may contain other pairs.

   #+BEGIN_SRC scheme
(define x (cons (cons 1 2) 3))
x                                       ; => ((1 . 2) . 3)
   #+END_SRC

   =Scheme= provides syntax sugar for /car of car/ and /cdr of car/.

   #+BEGIN_SRC scheme
(define y (cons (cons 1 2) 3))
(= (car (car y)) (caar y))              ; => #t
(= (cdr (car y)) (cdar y))              ; => #t
   #+END_SRC

   c\(\dots\)r-style for up to four cascades are guaranteed to exist.

** Tail Nested Pair

   When "tail recursion", i.e., nested along the second element,
   =Scheme= has a simplified form.

   #+BEGIN_SRC scheme
(cons 1 (cons 2 (cons 3 4)))            ; (1 2 3 . 4)
(equal? '(1 2 3 . 4)
        (cons 1 (cons 2 (cons 3 4))))   ; => #t
   #+END_SRC

** List

   - List :: Tail-nested pair with the very last element being an
        empty list, i.e., =​'()= (note that empty list is not
        self-evaluating).


   Constructed using recursive pair notation, =list= procedure or
   =quote=, tested with =list?= predicate.

   #+BEGIN_SRC scheme
(equal? (cons 1 (cons 2 (cons 3 (cons 4 '()))))
        '(1 2 3 4))                     ; => #t
(equal? (list 1 2 3 4) '(1 2 3 4))      ; => #t
(equal? '(1 2 3 4) '(1 2 3 4 . ()))     ; => #t
(equal? '(1 . ()) (cons 1 '()))         ; => #t
   #+END_SRC

** List Operation

   Like vector, list may be accessed by 0-based index.

   #+BEGIN_SRC scheme
(define x '(1 2 3 4))
(list-ref x 0)                          ; => 1
   #+END_SRC

   You may retrieve tail of list given starting position.

   #+BEGIN_SRC scheme
(define x '(1 2 3 4))
(list-tail x 2)                         ; => (3 4)
   #+END_SRC

   Most implementations include =list-head= procedure, but it is not
   specified in R6RS.

** List and Pair

   List and Pair are not equivalent.

   #+BEGIN_SRC scheme
(pair? '(1 . 2))                        ; => #t
(list? '(1 . 2))                        ; => #f
(pair? '(1 2))                          ; => #t
(list? '(1 2))                          ; => #t
(pair? '())                             ; => #f
(list? '())                             ; => #t
(null? '())                             ; => #t
   #+END_SRC

** Procedure

   Built-in procedure may be found in R^{6}RS specification.

   Anonymous procedure is defined with =lambda=.  E.g., The following
   form defines an anonymous procedure that adds 2 to the input.

   #+BEGIN_SRC scheme
(lambda (x) (+ x 2))
   #+END_SRC

   - The first subform, e.g., =(x)=, is the argument list
   - the rest subform, e.g., =(+ x 2)=, is the body of the procedure.


   To use this anonymous procedure

   #+BEGIN_SRC scheme
((lambda (x) (+ x 1) (+ x 1)) 3)        ; => 5
   #+END_SRC

** Procedure Cont'd

   To avoid repeated redefining the procedure.  We may bind a symbol
   to this procedure value.

   #+BEGIN_SRC scheme
(define add2 (lambda (x) (+ x 2)))
(add2 3)                                ; => 5
   #+END_SRC

   The =lambda= may be omitted.

   #+BEGIN_SRC scheme
(define (add2 x) (+ x 2))
(add2 3)                                ; => 5
   #+END_SRC

   Procedure is /first-class citizen/.

   #+BEGIN_SRC scheme
(define (f x) (+ x 1))
(define (g op x) (op x))
(g f 0)                                 ; => 1
   #+END_SRC

** Port

   - Port :: The conduit through which input and output is performed.
        Ports are usually associated with files and consoles.


   The =display= procedure takes a optional second argument of port.

   #+BEGIN_SRC scheme
(display "Hello World" (current-output-port))
   #+END_SRC

* Variable Binding

** Local Variable

   The =let= is a binding structure.  It binds =x= to 3 and =y= to 4.
   The rest subforms evaluate sequentially and the value of the last
   form is returned, e.g., 7 in this case.

   #+BEGIN_SRC scheme
(let ((x 3)
      (y 4))
  (+ x y))                              ; => 7
x                                       ; ERROR
   #+END_SRC

   Note that evaluating =x= outside =(let ...)= results in error.  So
   =x= is visible only inside the =let= enviroment.

** Gobal Variable

   To create a top-level (in the body of a top-level program or
   library) binding for identifiers (similar to global variable), use
   =define=.

   #+BEGIN_SRC scheme
(define x 3)
(define y 4)
(+ x y)                                 ; => 7
   #+END_SRC

   Top-level binding may be /shaded/ by local bindings.

   #+BEGIN_SRC scheme
(define x 1)
(define y 2)

(let ((y 200)) (+ x y))                 ; => 201

(let ((y 200))
  (let ((y 300)) (+ x y)))              ; => 301
   #+END_SRC

** Closure

   #+ATTR_LaTeX: :options linenos,mathescape
   #+BEGIN_SRC scheme
(define (addn n)                        ; addn $\label{addn}$
  (lambda (b)
    (+ n b)))

(define add3 (addn 3))                  ; add3 $\label{add3}$

(add3 1)
(add3 2)
   #+END_SRC

   - Line \ref{addn} defines a procedure =addn=.  The procedure takes
     1 argument, =n=, and returns a /lambda function/.

   - Line \ref{add3} binds the lambda function returned by =(addn 3)=,
     to =add3=, which is now a function that takes one argument, =b=,
     with =n= bound to 3.

** Closure Cont'd

   #+BEGIN_SRC scheme
(define (make-counter)
  (let ((count 0))
    (lambda ()
      (set! count (+ 1 count))
      count)))

(define counter (make-counter))

(list (counter) (counter) (counter))    ; => (1 2 3)
(list (counter) (counter) (counter))    ; => (4 5 6)

(set! counter (make-counter))
(list (counter) (counter) (counter))    ; => (1 2 3)
   #+END_SRC

   Every procedure call of =counter= adds 1 to a "hidden" value
   somehow remembered by =counter=.  The /hidden/ value is /closure/.

** Macro



