slide/tutorial-scheme/tutorial-scheme.tex

\begin{frame}[fragile,label={sec:orgheadline30}]{Vector}
 Vectors are sequences with their elements being \emph{anything}.

\begin{minted}[]{scheme}
(vector 1 2 3 4)                        ; => #(1 2 3 4)
(vector #\a #\b)                        ; => #(#\a #\b)
(vector 1 "e" 'var)                     ; => #(1 "e" var)
\end{minted}

Similar to string type, vector also has \texttt{make-vector}, \texttt{vector-ref}
and \texttt{vector-set!} procedures.  And as expected, vector is checked
by predicate \texttt{vector?}.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline31}]{Pair}
 \begin{description}
\item[{Pair}] An \emph{ordered} pair of arbitrary data, with the first
element and second element referred to as \emph{car} and \emph{cdr}
respectively.
\end{description}


It is constructed by \texttt{cons} procedure or \texttt{quote} (note the dot in
between), tested with predicate \texttt{pair?}

\begin{minted}[]{scheme}
(cons 1 #t)                             ; => (1 . #t)
'(#\h . 3.14)                           ; => (#\h . 3.14)
(pair? (cons 1 #t))                     ; => #t
\end{minted}

Dotted pair must be quoted when used as data value since it is not
self-evaluating.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline32}]{Pair Operation}
 Pair supports \texttt{car}, \texttt{cdr} access operation

\begin{minted}[]{scheme}
(define x (cons 1 #\c))
x                                       ; => (1 . #\c)
(car x)                                 ; => 1
(cdr x)                                 ; => #\c
(define x (1 #\c))                      ; ERROR
\end{minted}

Mutator procedures include \texttt{set-car!} and \texttt{set-cdr!}.

\begin{minted}[]{scheme}
(define x (cons 1 2))
x                                       ; => (1 . 2)
(set-car! x #\h)
x                                       ; => (#\h . 2)
(set-cdr! x 3.2)
x                                       ; => (#\h . 3.2)
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline33}]{Nested Pair}
 Pair may contain other pairs.

\begin{minted}[]{scheme}
(define x (cons (cons 1 2) 3))
x                                       ; => ((1 . 2) . 3)
\end{minted}

\texttt{Scheme} provides syntax sugar for \emph{car of car} and \emph{cdr of car}.

\begin{minted}[]{scheme}
(define y (cons (cons 1 2) 3))
(= (car (car y)) (caar y))              ; => #t
(= (cdr (car y)) (cdar y))              ; => #t
\end{minted}

c\(\dots\)r-style for up to four cascades are guaranteed to exist.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline34}]{Tail Nested Pair}
 When "tail recursion", i.e., nested along the second element,
\texttt{Scheme} has a simplified form.

\begin{minted}[]{scheme}
(cons 1 (cons 2 (cons 3 4)))            ; (1 2 3 . 4)
(equal? '(1 2 3 . 4)
        (cons 1 (cons 2 (cons 3 4))))   ; => #t
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline35}]{List}
 \begin{description}
\item[{List}] Tail-nested pair with the very last element being an
empty list, i.e., \texttt{​'()} (note that empty list is not
self-evaluating).
\end{description}


Constructed using recursive pair notation, \texttt{list} procedure or
\texttt{quote}, tested with \texttt{list?} predicate.

\begin{minted}[]{scheme}
(equal? (cons 1 (cons 2 (cons 3 (cons 4 '()))))
        '(1 2 3 4))                     ; => #t
(equal? (list 1 2 3 4) '(1 2 3 4))      ; => #t
(equal? '(1 2 3 4) '(1 2 3 4 . ()))     ; => #t
(equal? '(1 . ()) (cons 1 '()))         ; => #t
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline36}]{List Operation}
 Like vector, list may be accessed by 0-based index.

\begin{minted}[]{scheme}
(define x '(1 2 3 4))
(list-ref x 0)                          ; => 1
\end{minted}

You may retrieve tail of list given starting position.

\begin{minted}[]{scheme}
(define x '(1 2 3 4))
(list-tail x 2)                         ; => (3 4)
\end{minted}

Most implementations include \texttt{list-head} procedure, but it is not
specified in R6RS.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline37}]{List and Pair}
 List and Pair are not equivalent.

\begin{minted}[]{scheme}
(pair? '(1 . 2))                        ; => #t
(list? '(1 . 2))                        ; => #f
(pair? '(1 2))                          ; => #t
(list? '(1 2))                          ; => #t
(pair? '())                             ; => #f
(list? '())                             ; => #t
(null? '())                             ; => #t
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline38}]{Procedure}
 Built-in procedure may be found in R\(^{\text{6}}\)RS specification.

Anonymous procedure is defined with \texttt{lambda}.  E.g., The following
form defines an anonymous procedure that adds 2 to the input.

\begin{minted}[]{scheme}
(lambda (x) (+ x 2))
\end{minted}

\begin{itemize}
\item The first subform, e.g., \texttt{(x)}, is the argument list
\item the rest subform, e.g., \texttt{(+ x 2)}, is the body of the procedure.
\end{itemize}


To use this anonymous procedure

\begin{minted}[]{scheme}
((lambda (x) (+ x 1) (+ x 1)) 3)        ; => 5
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline39}]{Procedure Cont'd}
 To avoid repeated redefining the procedure.  We may bind a symbol
to this procedure value.

\begin{minted}[]{scheme}
(define add2 (lambda (x) (+ x 2)))
(add2 3)                                ; => 5
\end{minted}

The \texttt{lambda} may be omitted.

\begin{minted}[]{scheme}
(define (add2 x) (+ x 2))
(add2 3)                                ; => 5
\end{minted}

Procedure is \emph{first-class citizen}.

\begin{minted}[]{scheme}
(define (f x) (+ x 1))
(define (g op x) (op x))
(g f 0)                                 ; => 1
\end{minted}
\end{frame}



\begin{frame}[fragile,label={sec:orgheadline40}]{Port}
 \begin{description}
\item[{Port}] The conduit through which input and output is performed.
Ports are usually associated with files and consoles.
\end{description}


The \texttt{display} procedure takes a optional second argument of port.

\begin{minted}[]{scheme}
(display "Hello World" (current-output-port))
\end{minted}
\end{frame}

\section{Variable Binding}
\label{sec:orgheadline46}

\begin{frame}[fragile,label={sec:orgheadline42}]{Local Variable}
 The \texttt{let} is a binding structure.  It binds \texttt{x} to 3 and \texttt{y} to 4.
The rest subforms evaluate sequentially and the value of the last
form is returned, e.g., 7 in this case.

\begin{minted}[]{scheme}
(let ((x 3)
      (y 4))
  (+ x y))                              ; => 7
x                                       ; ERROR
\end{minted}

Note that evaluating \texttt{x} outside \texttt{(let ...)} results in error.  So
\texttt{x} is visible only inside the \texttt{let} enviroment.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline43}]{Gobal Variable}
 To create a top-level (in the body of a top-level program or
library) binding for identifiers (similar to global variable), use
\texttt{define}.

\begin{minted}[]{scheme}
(define x 3)
(define y 4)
(+ x y)                                 ; => 7
\end{minted}

Top-level binding may be \emph{shaded} by local bindings.

\begin{minted}[]{scheme}
(define x 1)
(define y 2)

(let ((y 200)) (+ x y))                 ; => 201

(let ((y 200))
  (let ((y 300)) (+ x y)))              ; => 301
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline44}]{Closure}
 \begin{minted}[,linenos,mathescape]{scheme}
(define (addn n)                        ; addn $\label{addn}$
  (lambda (b)
    (+ n b)))

(define add3 (addn 3))                  ; add3 $\label{add3}$

(add3 1)
(add3 2)
\end{minted}

\begin{itemize}
\item Line \ref{addn} defines a procedure \texttt{addn}.  The procedure takes
1 argument, \texttt{n}, and returns a \emph{lambda function}.

\item Line \ref{add3} binds the lambda function returned by \texttt{(addn 3)},
to \texttt{add3}, which is now a function that takes one argument, \texttt{b},
with \texttt{n} bound to 3.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline45}]{Closure Cont'd}
 \begin{minted}[]{scheme}
(define (make-counter)
  (let ((count 0))
    (lambda ()
      (set! count (+ 1 count))
      count)))

(define counter (make-counter))

(list (counter) (counter) (counter))    ; => (1 2 3)
(list (counter) (counter) (counter))    ; => (4 5 6)

(set! counter (make-counter))
(list (counter) (counter) (counter))    ; => (1 2 3)
\end{minted}

Every procedure call of \texttt{counter} adds 1 to a "hidden" value
somehow remembered by \texttt{counter}.  The \emph{hidden} value is \emph{closure}.
\end{frame}
\end{document}
